Tekla.Structures.Drawing.WeldMark.SeamVisibilityAttributes
The SeamVisibilityAttributes class is the attributes class for the weld seam visibility.

Tekla.Structures.Drawing.WeldMark.SeamVisibilityAttributes.ShowPrefix
Gets or sets a value indicating whether the seam prefix is visible.

Tekla.Structures.Drawing.WeldMark.SeamVisibilityAttributes.ShowSize
Gets or sets a value indicating whether the seam size is visible.

Tekla.Structures.Drawing.WeldMark.SeamVisibilityAttributes.ShowType
Gets or sets a value indicating whether the seam type is visible.

Tekla.Structures.Drawing.WeldMark.SeamVisibilityAttributes.ShowAngle
Gets or sets a value indicating whether the seam angle is visible.

Tekla.Structures.Drawing.WeldMark.SeamVisibilityAttributes.ShowContour
Gets or sets a value indicating whether the seam contour is visible.

Tekla.Structures.Drawing.WeldMark.SeamVisibilityAttributes.ShowFinish
Gets or sets a value indicating whether the seam finish is visible.

Tekla.Structures.Drawing.WeldMark.SeamVisibilityAttributes.ShowLength
Gets or sets a value indicating whether the seam length is visible.

Tekla.Structures.Drawing.WeldMark.SeamVisibilityAttributes.ShowPitch
Gets or sets a value indicating whether the seam pitch is visible.

Tekla.Structures.Drawing.WeldMark.SeamVisibilityAttributes.ShowEffectiveThroat
Gets or sets a value indicating whether the seam effective throat is visible.

Tekla.Structures.Drawing.WeldMark.SeamVisibilityAttributes.ShowRootOpening
Gets or sets a value indicating whether the seam root opening is visible.

Tekla.Structures.Drawing.WeldMark.SeamVisibilityAttributes.#ctor
Creates a new weld seam visibility attributes instance.

Tekla.Structures.Drawing.WeldMark.SeamVisibilityAttributes.#ctor(System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean)
Creates a new weld seam visibility attributes instance with the given attributes.
showPrefix: The seam prefix visibility to be used.
showSize: The seam size visibility to be used.
showType: The seam type visibility to be used.
showAngle: The seam angle visibility to be used.
showContour: The seam contour visibility to be used.
showFinish: The seam finish visibility to be used.
showLength: The seam length visibility to be used.
showPitch: The seam pitch visibility to be used.
showEffectiveThroat: The seam effective throat visibility to be used.
showRootOpening: The seam root opening visibility to be used.

Tekla.Structures.Drawing.WeldMark.SeamVisibilityAttributes.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.